// Задача 58: Задайте две матрицы. Напишите программу, которая будет находить произведение двух матриц.

(int[,], int[,]) CreateArray() {
    int[,] array1 = new int[2, 2];
    int[,] array2 = new int[2, 2];

    return (array1, array2);
}



Console.Clear();
Console.WriteLine("Привет! Эта программа находит строку с наименьшей суммой элементов.");
Console.WriteLine();

