// Задача 62. Напишите программу, которая заполнит спирально массив 4 на 4.

int[,] CreateArray() {
    int[,] array = new int[4, 4];

    return array;
}

int[,] FillArray(int[,] emptyArray) {
    for(int i; i < emptyArray.GetLength(0); i++) {
        for(int i = 0; i < emptyArray.GetLength(1); i++) {
            
        }
    }
}

Console.Clear();
Console.WriteLine("Привет! Эта программа заполняет спирально массив 4 на 4.");
Console.WriteLine();

CreateArray();